index.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <title>About - Aaron Kuehler</title>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Aaron Kuehler" />
    <meta name="description" content="80% Scientist, 20% Artist. Theorist and practitioner." />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/main.css" type="text/css"></noscript>
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/prettify.css" type="text/css"></noscript>
  </head>

  <body>
    <a href="#main">skip to main content</a>
<header class="masthead navigation">
  <div class="navigation-wrapper">
    <h1 class="masthead-title"><a href="/">Aaron Kuehler</a></h1>
    <p>80% Scientist, 20% Artist. Theorist and Practitioner.</p>
    <nav role="navigation">
      <ul class="navigation-menu show">
          <li class="nav-link"><a href="/blog/">Blog</a></li>
        <li><a href="/tags/">Tags</a></li>
        <li><a href="https://github.com/indiebrain">GitHub</a></li>
        <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
  </div>
</header>

    <main id="main">
<div>
<div class="post">
<h1>About</h1>
<blockquote>
<p>
Always remember, our purpose is not to "write code", but rather add value to the business.
</p>
</blockquote>

<p>
Hi, I'm Aaron!
</p>

<p>
I'm a human being - I have varying interests. I'm a father, musician, brewer, soap maker, photographer, electronics tinkerer&#x2026; a general lover of understanding and making.
</p>

<p>
By trade, I develop software and technical teams. I began studying Computational Science and Computer Programming in 1999. I passionately continue to advance my understanding of both fields in order to improve my professional practice. I am an ardent user of automated testing. I use tests to guide and define the interfaces and interactions of my software from the outside-in. Shortly after beginning my career as a software developer, I realized that developing software is more about interacting and effectively communicating with humans than with machines. I value the enhancement of understanding of human behavior, communication and relationships, and leadership skills - in my experience, these 'soft' skills tend to contribute more in the calculus of the success of individuals and teams than technical ability alone. I enjoy helping teams grow to understand and value these skills.
</p>

<div id="outline-container-orgb92cc3c" class="outline-2">
<h2 id="orgb92cc3c">OSS Contributions</h2>
<div class="outline-text-2" id="text-orgb92cc3c">
</div>
<div id="outline-container-org68d05e3" class="outline-3">
<h3 id="org68d05e3">Shopify/kubernetes-deploy</h3>
<div class="outline-text-3" id="text-org68d05e3">
<p>
<a href="https://github.com/Shopify/kubernetes-deploy">https://github.com/Shopify/kubernetes-deploy</a>
</p>

<p>
kubernetes-deploy is a command line tool that helps you ship changes to a Kubernetes namespace and understand the result.
</p>
</div>
</div>

<div id="outline-container-org85280ee" class="outline-3">
<h3 id="org85280ee">heroku-cli-buildpack</h3>
<div class="outline-text-3" id="text-org85280ee">
<p>
<a href="https://github.com/Thermondo/heroku-cli-buildpack">https://github.com/Thermondo/heroku-cli-buildpack</a>
</p>

<p>
Installs the Heroku toolbelt on a heroku dyno.
</p>
</div>
</div>

<div id="outline-container-org8f107c4" class="outline-3">
<h3 id="org8f107c4">Keyword Parameter Matchers</h3>
<div class="outline-text-3" id="text-org8f107c4">
<p>
<a href="https://github.com/terryfinn/keyword_parameter_matchers">https://github.com/terryfinn/keyword_parameter_matchers</a>
</p>

<p>
RSpec matchers for method keyword parameters.
</p>
</div>
</div>

<div id="outline-container-org178615a" class="outline-3">
<h3 id="org178615a">githug</h3>
<div class="outline-text-3" id="text-org178615a">
<p>
<a href="https://github.com/Gazler/githug">https://github.com/Gazler/githug</a>
</p>

<p>
Githug is designed to give you a practical way of learning git. It has a series of levels, each requiring you to use git commands to arrive at a correct answer.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd4bc176" class="outline-2">
<h2 id="orgd4bc176">Side Projects</h2>
<div class="outline-text-2" id="text-orgd4bc176">
</div>
<div id="outline-container-orgbb80138" class="outline-3">
<h3 id="orgbb80138">Futurist</h3>
<div class="outline-text-3" id="text-orgbb80138">
<p>
<a href="https://github.com/indiebrain/futurist">https://github.com/indiebrain/futurist</a>
</p>

<p>
An implementation of the future construct, inspired by Celluloid's block based futures, which uses process forking as a means of backgrounding work.
</p>
</div>
</div>

<div id="outline-container-org35c1c4c" class="outline-3">
<h3 id="org35c1c4c">Backbone-Elasticsearch</h3>
<div class="outline-text-3" id="text-org35c1c4c">
<p>
<a href="https://github.com/indiebrain/backbone-elasticsearch">https://github.com/indiebrain/backbone-elasticsearch</a>
</p>

<p>
Adapters and Utilities to interface Backbone.js with ElasticSearch
</p>
</div>
</div>

<div id="outline-container-orge45603e" class="outline-3">
<h3 id="orge45603e">OmniAuth Doximity OAuth2</h3>
<div class="outline-text-3" id="text-orge45603e">
<p>
<a href="https://github.com/indiebrain/omniauth-doximity_oauth2">https://github.com/indiebrain/omniauth-doximity_oauth2</a>
</p>

<p>
A Doximity OAuth2 Strategy for OmniAuth.
</p>
</div>
</div>
</div>

<div id="outline-container-org01e4622" class="outline-2">
<h2 id="org01e4622">Elsewhere</h2>
<div class="outline-text-2" id="text-org01e4622">
<ul class="org-ul">
<li><a href="https://www.linkedin.com/in/aaronkuehler">https://www.linkedin.com/in/aaronkuehler</a></li>
<li><a href="https://www.github.com/indiebrain">https://www.github.com/indiebrain</a></li>
<li><a href="https://www.twitter.com/indiebrain">https://www.twitter.com/indiebrain</a></li>
</ul>
</div>
</div>

</div>
</div>
    <div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="/media/js/main.js"></script>
      <script type="text/javascript">
        var _gaq = _gaq || [];
        _gaq.push(['_setAccount', 'UA-113071078-1']);
        _gaq.push(['_trackPageview']);
        (function() {
        var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
        ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
        var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
        })();
      </script>
      <div class="footer">
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> Aaron Kuehler
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

    </main>
  </body>
</html>
